Public Attributes | List of all members
API_CurtainWallType Struct Reference
Element Manager API
Represents a Curtain Wall element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_ZoneRelID  | zoneRel
Relation to zones. See API_ZoneRelID.
short  | pen
The pen index.
double  | nominalWidth
Nominal width of the Curtain Wall.
bool  | flipped
The curtain wall is flipped.
double  | offset
Panel offset to the reference plane.
double  | distanceInside
Theoretical border of the curtain wall.
double  | distanceOutside
Theoretical border of the curtain wall.
API_CWBoundaryFramePosID  | boundaryFramePosition
Boundary Frame position.
API_LinkToSettings  | linkToSettings
Link to story settings. See API_LinkToSettings.
API_StoryVisibility  | visibility
Story visibility. See API_StoryVisibility.
bool  | isAutoOnStoryVisibility
Story visibility will be automatically recalculated when needed.
double  | storyRelLevel
Base level (relative to home story).
API_ElemDisplayOptionsID  | displayOption
Floor plan display option. See API_ElemDisplayOptionsID.
API_ElemProjectionModesID  | cutProjectionMode
Cut projection mode. See API_ElemProjectionModesID.
API_ElemProjectionModesID  | uncutProjectionMode
Uncut projection mode. See API_ElemProjectionModesID.
API_ElemProjectionModesID  | overheadProjectionMode
Overhead projection mode. See API_ElemProjectionModesID.
API_ElemViewDepthLimitationsID  | viewDepthLimitation
Floor plan view depth limitation. See API_ElemViewDepthLimitationsID.
API_AttributeIndex  | overheadLineType
Linetype of view above cutplane on the floorplan.
short  | overheadLinePen
Pen index of view above cutplane on the floorplan.
short  | uncutLinePen
Pen index of view below cutplane on the floorplan.
API_AttributeIndex  | uncutLineType
Linetype of view below cutplane on the floorplan.
API_AttributeIndex  | frameCutLineType
Line index of the cut part of frames on the floorplan.
short  | frameCutLinePen
Pen index of the cut part of frames on the floorplan.
short  | panelCutLinePen
Pen index of the cut part of panels on the floorplan.
API_AttributeIndex  | panelCutLineType
Line index of the cut part of panels on the floorplan.
bool  | useFrameTypesAttributes
Use Frame type's attributes.
bool  | usePanelTypesAttributes
Use Panel type's attributes.
API_OverriddenPen  | cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
API_CWPlacementID  | placementMethod
Placement method.
API_CWSegmentType  | segmentData
Curtain Wall Segment related data.
API_CWFrameType  | cornerFrameData
Parameters of corner frames.
API_CWFrameType  | boundaryFrameData
Parameters of boundary frames.
API_CWJunctionType  | junctionData
Parameters of junctions.
API_CWAccessoryType  | accessoryData
Parameters of glass accessories.
double  | angle
Angle of the curtain wall (input only).
double  | height
Height of the curtain wall (input only).
API_Polygon  | polygon
API_Tranmat  | planeMatrix
double  | planeOffset
UInt32  | nSegments
Number of segments.
UInt32  | nFrames
Number of frames.
UInt32  | nFrameDefaults
Number of custom frame classes (Corner Frame and Boundary Frame Classes are not included).
UInt32  | nPanels
Number of panels.
UInt32  | nPanelDefaults
Number of panel classes.
UInt32  | nJunctions
Number of junctions.
UInt32  | nAccessories
Number of accessories.
Detailed Description
Represents a Curtain Wall element.
Remarks
The Curtain Wall is a hierarchical (system) element consisting of Frame, Panel, Accessory and Junction components: these are the Members of the Curtain Wall, arranged on a Base Surface according to a pre-defined scheme. By default all CW component is generic and has built from the owner elem. The elements' cut fill foreground and background pens inherit from the building material, and can be overridden on the element level. In Archicad 22, the Frames and Panels of a Curtain Wall element are no longer forced into primary/secondary or glass/glazed categories, with the exception of Boundary Frames, which are still a separate category. As so, the other default Frame and Panel elements are found in the corresponding API_ElementMemo structure. Also, Curtain Wall subelements now contain their own library part identifiers instead of the Curtain Wall structure itself.
Member Data Documentation
◆ accessoryData
 API_CurtainWallType::accessoryData
Parameters of glass accessories.
◆ angle
 API_CurtainWallType::angle
Angle of the curtain wall (input only).
◆ boundaryFrameData
 API_CurtainWallType::boundaryFrameData
Parameters of boundary frames.
◆ boundaryFramePosition
 API_CurtainWallType::boundaryFramePosition
Boundary Frame position.
◆ cornerFrameData
 API_CurtainWallType::cornerFrameData
Parameters of corner frames.
◆ cutFillBackgroundPen
 API_CurtainWallType::cutFillBackgroundPen
Cut fill pens set in the building material can be overridden on the element level.
◆ cutFillPen
 API_CurtainWallType::cutFillPen
Cut fill pens set in the building material can be overridden on the element level.
◆ cutProjectionMode
 API_CurtainWallType::cutProjectionMode
Cut projection mode. See API_ElemProjectionModesID.
◆ displayOption
 API_CurtainWallType::displayOption
Floor plan display option. See API_ElemDisplayOptionsID.
◆ distanceInside
 API_CurtainWallType::distanceInside
Theoretical border of the curtain wall.
◆ distanceOutside
 API_CurtainWallType::distanceOutside
Theoretical border of the curtain wall.
◆ flipped
 API_CurtainWallType::flipped
The curtain wall is flipped.
◆ frameCutLinePen
 API_CurtainWallType::frameCutLinePen
Pen index of the cut part of frames on the floorplan.
◆ frameCutLineType
 API_CurtainWallType::frameCutLineType
Line index of the cut part of frames on the floorplan.
◆ head
 API_CurtainWallType::head
General element header.
◆ height
 API_CurtainWallType::height
Height of the curtain wall (input only).
◆ isAutoOnStoryVisibility
 API_CurtainWallType::isAutoOnStoryVisibility
Story visibility will be automatically recalculated when needed.
◆ junctionData
 API_CurtainWallType::junctionData
Parameters of junctions.
◆ linkToSettings
 API_CurtainWallType::linkToSettings
Link to story settings. See API_LinkToSettings.
◆ nAccessories
 API_CurtainWallType::nAccessories
Number of accessories.
◆ nFrameDefaults
 API_CurtainWallType::nFrameDefaults
Number of custom frame classes (Corner Frame and Boundary Frame Classes are not included).
◆ nFrames
 API_CurtainWallType::nFrames
Number of frames.
◆ nJunctions
 API_CurtainWallType::nJunctions
Number of junctions.
◆ nominalWidth
 API_CurtainWallType::nominalWidth
Nominal width of the Curtain Wall.
◆ nPanelDefaults
 API_CurtainWallType::nPanelDefaults
Number of panel classes.
◆ nPanels
 API_CurtainWallType::nPanels
Number of panels.
◆ nSegments
 API_CurtainWallType::nSegments
Number of segments.
◆ offset
 API_CurtainWallType::offset
Panel offset to the reference plane.
◆ overheadLinePen
 API_CurtainWallType::overheadLinePen
Pen index of view above cutplane on the floorplan.
◆ overheadLineType
 API_CurtainWallType::overheadLineType
Linetype of view above cutplane on the floorplan.
◆ overheadProjectionMode
 API_CurtainWallType::overheadProjectionMode
Overhead projection mode. See API_ElemProjectionModesID.
◆ panelCutLinePen
 API_CurtainWallType::panelCutLinePen
Pen index of the cut part of panels on the floorplan.
◆ panelCutLineType
 API_CurtainWallType::panelCutLineType
Line index of the cut part of panels on the floorplan.
◆ pen
 API_CurtainWallType::pen
The pen index.
◆ placementMethod
 API_CurtainWallType::placementMethod
Placement method.
◆ planeMatrix
 API_Tranmat API_CurtainWallType::planeMatrix
◆ planeOffset
 double API_CurtainWallType::planeOffset
◆ polygon
 API_Polygon API_CurtainWallType::polygon
◆ segmentData
 API_CurtainWallType::segmentData
Curtain Wall Segment related data.
◆ storyRelLevel
 API_CurtainWallType::storyRelLevel
Base level (relative to home story).
◆ uncutLinePen
 API_CurtainWallType::uncutLinePen
Pen index of view below cutplane on the floorplan.
◆ uncutLineType
 API_CurtainWallType::uncutLineType
Linetype of view below cutplane on the floorplan.
◆ uncutProjectionMode
 API_CurtainWallType::uncutProjectionMode
Uncut projection mode. See API_ElemProjectionModesID.
◆ useFrameTypesAttributes
 API_CurtainWallType::useFrameTypesAttributes
Use Frame type's attributes.
◆ usePanelTypesAttributes
 API_CurtainWallType::usePanelTypesAttributes
Use Panel type's attributes.
◆ viewDepthLimitation
 API_CurtainWallType::viewDepthLimitation
Floor plan view depth limitation. See API_ElemViewDepthLimitationsID.
◆ visibility
 API_CurtainWallType::visibility
Story visibility. See API_StoryVisibility.
◆ zoneRel
 API_CurtainWallType::zoneRel
Relation to zones. See API_ZoneRelID.